---
Description: Downloads the latest Open Shell
Identifier: com.github.bigfix.download.OpenShell-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: OpenShell
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Open-Shell
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://github.com/Open-Shell/Open-Shell-Menu/releases
      # example match `example`
      re_pattern: <a href.*?v(?P<version>.*?)/Open.*?exe"

  - Processor: URLTextSearcher
    Arguments:
      url: https://github.com/Open-Shell/Open-Shell-Menu/releases/tag/v%version%
      # example match `example`
      re_pattern: v%version%.*?Setup_(?P<filename>.*?.exe)

  - Processor: EndOfCheckPhase
