---
Description: Downloads the latest OpenShot
Identifier: com.github.bigfix.download.OpenShot-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "OpenShot"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "OpenShot"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.openshot.org/download/
      # example match `example`
      re_pattern: '>OpenShot (?P<version>\d+\.\d+\.\d+) Released'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://github.com/OpenShot/openshot-qt/releases/download/v%version%/OpenShot-v%version%-x86_64.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
