---
Description: Downloads the latest VNC Viewer
Identifier: com.github.bigfix.download.VNCViewer
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "VNCViewer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "VNC Viewer"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.realvnc.com/en/connect/download/viewer/
      # example match `example`
      re_pattern: 'VNC\-Viewer\-(?P<version>\d+\.\d+\.\d+)\-Windows\-msi\.zip'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.realvnc.com/download/file/viewer.files/VNC-Viewer-%version%-Windows-msi.zip
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
