---
Description: Downloads the latest AdoptOpenJDK11 (JDK) for Win64
Identifier: com.github.bigfix.download.AdoptOpenJDK11-JDK
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "AdoptOpenJDK11-JDK"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Eclipse Temurin JDK with Hotspot"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://api.adoptium.net/v3/assets/latest/11/hotspot
      re_pattern: '\"(?P<url>https\:\/\/.*\/OpenJDK11U\-jdk\_x64\_windows\_hotspot\_.*\.msi)\"'
  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
