---
Description: Downloads the latest Authy For Windows x64
Identifier: com.github.bigfix.download.Foxit_PDF_Reader-Win64
Input:
  NAME: "Foxit_PDF_Reader"
  FileType: exe
  DisplayName: "Foxit PDF Reader"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: 'https://www.foxit.com/pdf-reader/version-history.html'
  #     re_pattern: '<p><h3>Version (?P<version>\d+\.\d+.\d+)'

  # - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
  #   Arguments:
  #     input_string: '%version%'
  #     find: '.'
  #     replace: ''

  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.foxit.com/downloads/latest.html?product=Foxit-Reader&platform=Windows&package_type=exe&language=German
      filename: FoxitPDFReader_L10N_Setup_Prom.exe
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
