---
Description: Generates a BigFix Task for the latest Rancher Desktop for Windows x64
Identifier: com.github.bigfix.bigfix.RancherDesktop-Win64
Input:
  NAME: Rancher Desktop
  DisplayName: Rancher Desktop
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.RancherDesktop-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      filename: "logo-square-512.png"
      url: https://github.com/rancher-sandbox/rancher-desktop/raw/main/resources/icons/logo-square-512.png
      COMPUTE_HASHES: False
      download_version: ""

  # get base64 of icon file:
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Rancher/RancherDesktop-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
