---
Description: Downloads the latest Dell Command Update
Identifier: com.github.bigfix.download.DellCommandUpdate-Win
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: DellCommandUpdate
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Dell Command Update
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: https://example
  #     # example match `example`
  #     re_pattern: 'example(?P<version>\d+)-64.msi'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://dl.dell.com/FOLDER07582851M/2/Dell-Command-Update-Application_8D5MC_WIN_4.3.0_A00_01.EXE
      #url: https://dl.dell.com/FOLDER07582763M/1/Dell-Command-Update-Application-for-Windows-10_GRVPK_WIN_4.3.0_A00.EXE
      #    download_version: "%version%"
      COMPUTE_HASHES: True
      #User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
  - Processor: EndOfCheckPhase
