---
Description: Downloads the latest Classic Shell
Identifier: com.github.bigfix.download.ClassicShell-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: ClassicShell
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Classic Shell
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: http://www.classicshell.net/
      # example match `example`
      re_pattern: The latest stable version .*?\>(?P<version>.*?)<

  - Processor: URLTextSearcher
    Arguments:
      url: https://www.fosshub.com/Classic-Shell.html
      # example match `example`
      re_pattern: href\=\"(?P<url>.*?)\" data.*?English<

  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
