---
Description: Generates a BigFix Task for the latest Sandboxie Plus
Identifier: com.github.bigfix.bigfix.SandboxiePlus-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "SandboxiePlus"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Sandboxie Plus"
  VendorFolder: "Sandboxie"
  64BitOnly: True
  RecipeStatus: In Progress
  PublicDesktopShortcutFile: Sandboxie-Plus.lnk
  cmd_args: /verysilent
  exe_file: True
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.SandboxiePlus-Win64
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # `BigFixPrefetchItem` takes the hashes from `URLDownloaderPython`
  #   Then it assembles them into a BigFix Prefetch Statement or Block
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  # This is here because the Sandboxie GitHub releases page has both "Classic" and
  #  "Plus" version numbers for each release, and so the download recipie has two
  #  variables classicVersion and plusVersion instead of the usual version one.
  #  Additionally, there is a letter sometimes associated with "Plus" releases.
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "version"
      append_value: "%plusVersion%%plusLetter%"

  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./%VendorFolder%/%NAME%-Win-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  # `BESImport` imports the generated BES content into a BigFix Server
  #   Which server and credentials are used is dictated by `~/.besapi.conf`
  - Processor: com.github.jgstew.SharedProcessors/BESImport

  # `BigFixActioner` creates an action from the imported BigFix Content
  #   The action is an offer that requires user interaction to run in self service application
  #   The action targets all computers whose name contains `autopkg`
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./%VendorFolder%/%NAME%-Win-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
