---
Description: Downloads the latest Sandboxie Plus
Identifier: com.github.bigfix.download.SandboxiePlus-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "SandboxiePlus-Win64"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Sandboxie Plus"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://github.com/sandboxie-plus/Sandboxie/releases/latest
      # example match `example`
      re_pattern: 'Release v(?P<plusVersion>\d+\.\d+\.\d+)(?P<plusLetter>[a-z].*) / (?P<classicVersion>\d+\.\d+\.\d+)'

  - Processor: URLTextSearcher
    Arguments:
      url: https://github.com/sandboxie-plus/Sandboxie/releases/latest
      # example match `example`
      re_pattern: 'Sandboxie-Plus-x64-v(?P<plusFilename64>.*).exe'

  - Processor: URLDownloaderPython
    Arguments:
      url: https://github.com/sandboxie-plus/Sandboxie/releases/download/%plusVersion%%plusLetter%/Sandboxie-Plus-x64-v%plusFilename64%.exe
      download_version: "%plusVersion%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
