---
Description: Downloads the latest MalwareBytes
Identifier: com.github.bigfix.download.Malwarebytes-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: MalwareBytes
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: MalwareBytes
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.

  - Processor: URLDownloaderPython
    Arguments:
      url: https://downloads.malwarebytes.com/file/mb-windows
      filename: mbsetup.exe
      # download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
