---
Description: Generates BigFix Task for latest 7Zip
Identifier: com.github.zanesand.bigfix.Git-Win64
Input:
  NAME: GitWin64
MinimumVersion: '2.3'
ParentRecipe: com.github.zanesand.download.Git-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./GIT/GitForWindows-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
    Arguments:
      bes_file: "%content_file_pathname%"
      bes_customsite: autopkg
