---
Description: Downloads the latest 3DXMLPlayer
Identifier: com.github.bigfix.download.3DXMLPlayer-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "3DXMLPlayer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "3D XML Player"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.shared.parent-recipe
Process:
  # `SharedUtilityMethods` must come first
  #- Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.3ds.com/products-services/3d-xml/downloads/
      # example match `example`
      re_pattern: '<b>Version</b>: (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.3ds.com/fileadmin/PRODUCTS-SERVICES/3DXML/3DXMLPlayer_x64.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
