---
Description: Downloads the latest JabraDirect
Identifier: com.github.bigfix.download.JabraDirect-Win
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "JabraDirect"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Jabra Direct"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: https://www.jabra.in/Support/release-notes/release-note-jabra-direct
  #     # example match `example`
  #     re_pattern: 'Release version:</strong> (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://jabraxpressonlineprdstor.blob.core.windows.net/jdo/JabraDirectSetup.exe
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
