Description: Downloads the latest Example
Identifier: com.github.bigfix.download.Example
Input:
  NAME: Example
  DisplayName: Example Software DisplayName
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://example
      # example match `example`
      re_pattern: 'example(?P<version>\d+)-64.msi'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://example%version%.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
