---
Description: Downloads the latest Amazon Corretto 8 (JDK)
Identifier: com.github.bigfix.download.AmazonCorretto8JDK-Win64
Input:
  NAME: "AmazonCorretto8JDK"
  DisplayName: "Amazon Corretto 8 (x64)"
MinimumVersion: '2.3'
Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: https://corretto.aws/downloads/latest/amazon-corretto-8-x64-windows-jdk.msi
      COMPUTE_HASHES: True
  - Processor: com.github.jgstew.SharedProcessors/WinGetPropertyMSI
  - Processor: EndOfCheckPhase
