---
Description: Downloads the latest AiViewer
Identifier: com.github.bigfix.download.AiViewer-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "AiViewer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "AI Viewer"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: https://aiviewer.com/download.aspx
  #     # example match `example`
  #     re_pattern: 'Download free Ai Viewer (?P<version>\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://aiviewer.com/aiviewersetup.exe
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
