---
Description: Generates a BigFix Task for the latest Azure Data Studio
Identifier: com.github.bigfix.bigfix.AzureDataStudio-Win64
Input:
  NAME: "AzureDataStudio"
  icon_url: https://www.dailyhostnews.com/wp-content/uploads/2019/03/Azure-featured-1050x600.png
  DisplayName: "Azure Data Studio"
  VendorFolder: AzureDataStudio
#  DocLink: https://docs.microsoft.com/en-us/sql/azure-data-studio/download-azure-data-studio?view=sql-server-ver15
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.AzureDataStudio-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_url: "%download_url%"
  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      # need to provide filename to not overwrite the setup file
      filename: "%NAME%-icon.png"
      url: "%icon_url%"
      COMPUTE_HASHES: False
  - Processor: com.github.jgstew.SharedProcessors/FileImageResize
  # get base64 of icon file
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
    Arguments:
      file_pathname: "%file_path_resized%"
  # add base64 of icon file to Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "DocLink"
      append_value: "%DocLink%"
  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./%VendorFolder%/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

    # create update(patch) only content:
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./%VendorFolder%/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
