---
Description: Downloads the latest UltraEdit
Identifier: com.github.bigfix.download.UltraEdit-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "UltraEdit"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "UltraEdit"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: https://www.ultraedit.com/
  #     # example match `example`
  #     re_pattern: 'Download UltraEdit <small>v(?P<version>\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://downloads.ultraedit.com/main/ue/win/ue_english_64.exe
      #download_version: ""
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
