---
Description: Downloads the latest Oxygen XML Developer
Identifier: com.github.bigfix.download.OxygenXMLDeveloper
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "OxygenXMLDeveloper"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Oxygen XML Developer"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.oxygenxml.com/xml_developer/download_oxygenxml_developer.html
      # example match `example`
      re_pattern: 'Version(?P<version>\:\ \d+\.\d+)'
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.oxygenxml.com/xml_developer/download_oxygenxml_developer.html
      # example match `example`
      re_pattern: '(?P<url>https:\/\/www\.oxygenxml\.com\/InstData\/Developer\/Windows\/VM\/oxygenDeveloper\.exe)'
  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
