---
Description: Downloads the latest Tableau Desktop
Identifier: com.github.bigfix.download.TableauDesktop
Input:
  NAME: "TableauDesktop"
  DisplayName: "Tableau"
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.tableau.com/support/releases
      # example match `2021.2.1`
      re_pattern: 'current version (?P<version>\d{4}\.\d\.?\d*)'
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.tableau.com/support/releases/desktop/%version%
      # example match `Build number 20212.21.0712.0907`
      re_pattern: 'Build number\<\/h2\>\s+\<p\>\<p\>(?P<BuildNumber>\d+\.\d+\.\d+\.\d+)\<\/p\>'
  - Processor: URLTextSearcher
    Arguments:
      url: https://downloads.tableau.com/esdalt/JSON/%version%.json
      # example match `"release_date":"07/22/2021"`
      re_pattern: '\"release_date\"\:\"(?P<Month>\d{2})\/(?P<Day>\d{2})\/(?P<Year>\d{4})\"'
  - Processor: URLTextSearcher
    Arguments:
      url: https://downloads.tableau.com/esdalt/JSON/%version%.json
      # example match `https://downloads.tableau.com/esdalt/2021.2.1/TableauDesktop-64bit-2021-2-1.exe`
      re_pattern: '(?P<url>https\:\/\/downloads\.tableau\.com\/esdalt\/\d+\.\d+\.\d+\/TableauDesktop\-64bit\-\d+\-\d+\-\d+\.exe)'
  - Processor: URLDownloaderPython
    Arguments:
      url: "%url%"
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase