---
Description: Downloads the latest Tableau Reader For Windows x64
Identifier: com.github.bigfix.download.TableauReader-Win64
Input:
  NAME: "TableauReader"
  FileType: exe
  DisplayName: "Tableau Reader"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.tableau.com/support/releases
      # example match `2021.2.1`
      re_pattern: 'current version (?P<build_version>\d{4}\.\d\.?\d*)'
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://www.tableau.com/downloads/reader/pc64'
      download_version: "%build_version%"
      COMPUTE_HASHES: True
      prefetch_filename: True
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
  - Processor: EndOfCheckPhase
