---
Description: Downloads the latest Plex Media Player
Identifier: com.github.bigfix.download.PlexMediaPlayer-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "PlexMediaPlayer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Plex Media Player"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://plex.tv/api/downloads/6.json
      # example match `example`
      re_pattern: '"https://downloads.plex.tv/plex-desktop/.*/windows/Plex-(\d+\.\d+\.\d+\.\d+)-.*-x86_64.exe"'
  # - Processor: URLDownloaderPython
  #   Arguments:
  #     url: https://example%version%.msi
  #     # download_version: "%version%"
  #     COMPUTE_HASHES: True
  # - Processor: EndOfCheckPhase
