---
Description: Generates BigFix Task for latest GoToMeeting
Identifier: com.github.bigfix.bigfix.GoToMeeting-Win
Input:
  NAME: GoToMeeting
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.GoToMeeting-Win
Process:
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version1%.%version2%"
      template_file_sha1: "%file_sha1%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./GoToMeeting/GoToMeeting-Win Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
    Arguments:
      bes_file: "%RECIPE_CACHE_DIR%/%NAME%.bes"
      bes_customsite: "AutoPKG"
