---
Description: Download GoToMeeting for Windows Generates BigFix Task for latest GoToMeeting
Identifier: com.github.bigfix.bigfix.GoToMeeting-Win
Input:
  NAME: GoToMeeting
  DisplayName: "%NAME%"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.GoToMeeting-Win
Process:
  # - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version1%.%version2%"
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
    Arguments:
      file_pathname: GoToMeeting/GoToMeeting-Icon.png
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./GoToMeeting/GoToMeeting-Win Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
