---
Description: Download GoToMeeting for Windows
Identifier: com.github.bigfix.download.GoToMeeting-Win
Input:
  NAME: GoToMeeting
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://support.goto.com/meeting/help/install-via-msi-windows-g2m010013
      re_pattern: 'Version (?P<version1>\d+\.\d+\.\d+), b(?P<version2>\d+) release notes\<\/a\> \(latest build\)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://link.gotomeeting.com/latest-msi
      prefetch_filename: True
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      COMPUTE_HASHES: True
      download_version: "%version1%.%version2%"
  - Processor: EndOfCheckPhase
