---
Description: Download GoToMeeting for Windows
Identifier: com.github.bigfix.download.GoToMeeting-Win
Input:
  NAME: GoToMeeting
MinimumVersion: '2.3'
Process:
  # https://github.com/autopkg/homebysix-recipes/blob/master/GoToMeeting/GoToMeetingURLProvider.py
  #- Processor: com.github.homebysix.download.GoToMeeting/GoToMeetingURLProvider
  # URLDownloader seems to redownload the file if only the etag changed: https://github.com/jgstew/jgstew-recipes/issues/3
  - Processor: URLDownloaderPython
    Arguments:
      url: https://link.gotomeeting.com/latest-msi
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
