---
Description: Downloads the latest GlavSoft TightVNC For Windows x64
Identifier: com.github.bigfix.download.tightvnc-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "TightVNC"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "TightVNC"
MinimumVersion: '2.3.2'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.tightvnc.com/download.php
      re_pattern: '<h3>Download TightVNC for Windows \(Version (?P<version>\d+\.\d+.\d+)'
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://www.tightvnc.com/download/%version%/tightvnc-%version%-gpl-setup-64bit.msi
     # prefetch_filename: True
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
