---
Description: Downloads the latest IconViewer
Identifier: com.github.bigfix.download.IconViewer
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: IconViewer
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "%NAME%"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.botproductions.com/iconview/download.html
      # example match `"download/IconViewer3.02-Setup-x64.exe"`
      re_pattern: 'IconViewer(?P<version>\d+.\d+)-Setup-x64.exe'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.botproductions.com/iconview/download/IconViewer%version%-Setup-x64.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
