Description: Generates a BigFix Prefetch for the latest Sysinternals Utilities
Identifier: com.github.bigfix.Sysinternals
Input:
  NAME: Sysinternals
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.Sysinternals
Process:
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Sysinternals/Sysinternals-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
  