---
Description: Downloads the latest XnView
Identifier: com.github.bigfix.download.XnView-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: XnView
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: XnView
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.xnview.com/en/xnview/#downloads
      # example match `example`
      re_pattern: 'Version (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.xnview.com/XnView-win-full.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
