---
Description: Downloads the latest Authy For Windows x64
Identifier: com.github.bigfix.download.Authy-Win64
Input:
  NAME: "Authy"
  FileType: exe
  DisplayName: "Authy"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      #https://s3.amazonaws.com/authy-electron-repository-production/authy/stable/1.8.4/win32/x64/Authy%20Desktop%20Setup%201.8.4.exe
      url: https://electron.authy.com/download?channel=stable&arch=x64&platform=win32&version=latest&product=authy
      prefetch_filename: True
      #download_version: "%version%"
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
  #- Processor: com.github.jgstew.SharedProcessors/FileExeVersionExtractor
