---
Description: Generates a BigFix Task for the latest PlantronicsHub For Windows x64
Identifier: com.github.bigfix.bigfix.PlantronicsHub-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "PlantronicsHub"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Plantronics Hub Software"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.PlantronicsHub-Win64
Process:
  # `BigFixPrefetchItem` takes the hashes from `URLDownloaderPython`
  #   Then it assembles them into a BigFix Prefetch Statement or Block
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon.png"
      url: https://cdn6.aptoide.com/imgs/f/3/d/f3ddec8d1ba646e312fda38e40694720_icon.png?w=256
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      COMPUTE_HASHES: False
  # get base64 of icon file:
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "version"
      append_value: "%latest_version%"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Polly/PlantronicsHub-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  # `BESImport` imports the generated BES content into a BigFix Server
  #   Which server and credentials are used is dictated by `~/.besapi.conf`
  - Processor: com.github.jgstew.SharedProcessors/BESImport

  # `BigFixActioner` creates an action from the imported BigFix Content
  #   The action is an offer that requires user interaction to run in self service application
  #   The action targets all computers whose name contains `autopkg`
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
