---
Description: Downloads the latest R for Windows
Identifier: com.github.bigfix.download.RforWindows-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "RforWindows"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "R for Windows"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://cran.r-project.org/bin/windows/base/
      # example match `example`
      re_pattern: 'Download R-(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://cran.r-project.org/bin/windows/base/R-%version%-win.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
