---
Description: Downloads the latest S3 Browser
Identifier: com.github.bigfix.download.S3Browser
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "S3Browser"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "S3 Browser"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://s3browser.com/download.aspx
      # example match `example`
      re_pattern: 'S3 Browser Version (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLTextSearcher
    Arguments:
      url: https://s3browser.com/download.aspx
      # example match `example`
      re_pattern: '(?P<url>https:\/\/s3browser\.com\/download\/s3browser-\d+-\d+-\d+\.exe)'
  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
