---
Description: Generates BigFix Task for latest mRemoteNG
Identifier: com.github.bigfix.bigfix.mRemoteNG-Win
Input:
  NAME: mRemoteNGWin
  # icon_url: https://mremoteng.readthedocs.io/en/master/_static/logo.png
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.mRemoteNG-Win
Process:
  # `SharedUtilityMethods` must come first
  #- Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  #- Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./mRemoteNG/mRemoteNG-Win-Install.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
