---
Description: Downloads the latest mRemoteNG for Windows x86
Identifier: com.github.bigfix.download.mRemoteNG-Win
Input:
  NAME: mRemoteNGWin
  TYPE: "msi"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: mRemoteNG/mRemoteNG
      asset_regex: .*\.%TYPE%$
      include_prereleases: False
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
