---
Description: Downloads the latest Snagit For Windows x64
Identifier: com.github.bigfix.download.Snagit-Win64
Input:
  NAME: "Snagit"
  FileType: exe
  DisplayName: "Snagit"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://download.techsmith.com/snagit/releases/snagit.exe'
      COMPUTE_HASHES: True
      prefetch_filename: True
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
  - Processor: EndOfCheckPhase
