---
Description: Generates BigFix Task for latest 7Zip x64 MSI
Identifier: com.github.bigfix.bigfix.7Zip-Win64
Input:
  NAME: 7Zip
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.7Zip-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_url: "%download_url%"
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%display_version%"
  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      # need to provide filename to not overwrite the setup file
      filename: "%NAME%-icon.png"
      url: https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/7ziplogo.svg/320px-7ziplogo.svg.png
      COMPUTE_HASHES: False
  # get base64 of icon file
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  # add base64 of icon file to Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./7Zip/7Zip-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
