---
Description: Generates a BigFix Task for the latest Zotero for Windows x86
Identifier: com.github.bigfix.bigfix.Zotero-Win
Input:
  NAME: "Zotero"
  DisplayName: "Zotero"
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.Zotero-Win
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon-147-160.png"
      url: https://www.zotero.org/static/images/icons/zotero-icon-147-160.png
      COMPUTE_HASHES: False

  # get base64 of icon file:
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "DisplayName"
      append_value: "%DisplayName%"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Zotero/Zotero-Win-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
