---
Description: Downloads the latest Zotero
Identifier: com.github.bigfix.download.Zotero-Win
Input:
  NAME: Zotero
  DisplayName: Zotero
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.zotero.org/download/
      re_pattern: '\"win32\"\:\"(?P<version>.*?)\"'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.zotero.org/download/client/dl?channel=release&platform=win32
      prefetch_filename: True
      COMPUTE_HASHES: True
      download_version: "%version%"
  - Processor: EndOfCheckPhase
