---
Description: Downloads the latest Zoom Client for Windows x64
Identifier: com.github.bigfix.download.zoomoutlookplugin-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "ZoomOutlookPlugin"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Zoom Outlook Plugin"
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: https://zoom.us/client/latest/ZoomOutlookPluginSetup.msi
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
