---
Description: Downloads the latest Zoom Client for Windows x64
Identifier: com.github.bigfix.download.zoomclient-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "ZoomClient"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Zoom Client"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  #- Processor: URLTextSearcher
    #Arguments:
      #url: https://zoom.us/download
      # example match `example`
      # /client/5.7.6.1055/ZoomInstallerFull.msi?archType=x64
      #re_pattern: '\/client\/(?P<latest_version>\d+\.\d+\.\d+\.\d+)\/ZoomInstallerFull\.msi\?archType=x64'
      #re_pattern: 'client\S\d+\.\d+\.\d+\.\d+\SZoomInstallerFull\.msi\SarchType\Sx64'
      #re_pattern: '\d+\/ZoomInstallerFull'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.zoom.us/client/latest/ZoomInstallerFull.msi
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
