---
Description: Downloads the latest Yubico Authenticator for Win64
Identifier: com.github.bigfix.download.YubicoAuthenticator-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "YubicoAuthenticator"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Yubico Authenticator"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.

  - Processor: com.github.jgstew.SharedProcessors/URLTextSearcherArray
    Arguments:
      #Example: '>yubioath-desktop-5.0.5-win64.msi<'
      url: https://developers.yubico.com/yubioath-desktop/Releases/
      re_pattern: '>yubioath-desktop-(?P<version>\d+\.\d+\.\d+)-win64.msi<'

  - Processor: com.github.jgstew.SharedProcessors/VersionMaximumArray

  - Processor: URLDownloaderPython
    Arguments:
      url: https://developers.yubico.com/yubioath-desktop/Releases/yubioath-desktop-%version_maximum%-win64.msi
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
