---
Description: Downloads the latest BlueJeans
Identifier: com.github.bigfix.download.BlueJeans-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "BlueJeans"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: BlueJeans
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.bluejeans.com/downloads
      # example match `example`
      re_pattern: 'https://swdl.bluejeans.com/desktop-app/win/(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://swdl.bluejeans.com/desktop-app/win/2.31.114.0/BlueJeans.2.31.114m.msi
  #   download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
