---
Description: Downloads the latest WinZip x64
Identifier: com.github.bigfix.download.WinZip-Win64
Input:
  NAME: WinZip-Win64
MinimumVersion: '2.3'
Process:
  # TODO: get download link from webpage, download
  - Processor: EndOfCheckPhase
