---
Description: Downloads the latest Remote Desktop Manager (x64)
Identifier: com.github.bigfix.download.remotedesktopmanager-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: RemoteDesktopManager
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Remote Desktop Manager
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.

  - Processor: URLDownloaderPython
    Arguments:
      url: https://remotedesktopmanager.com/home/thankyou/rdmmsi
      filename: setupremotedesktopmanager.msi
      COMPUTE_HASHES: True


  - Processor: com.github.jgstew.SharedProcessors/WinGetPropertyMSI

  - Processor: EndOfCheckPhase
