---
Description: Downloads the latest Remote Desktop Manager Enterprise
Identifier: com.github.bigfix.download.remotedesktopmanager-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: RemoteDesktopManager
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Remote Desktop Manager Enterprise (x64)
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://remotedesktopmanager.com/home/download
      # example match `example`
      re_pattern: Version (?P<version>\d+) |
  - Processor: URLDownloaderPython
    Arguments:
      url: https://cdn.devolutions.net/download/Setup.RemoteDesktopManager.%version%.msi
      # download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
