---
Description: Generates BigFix Task for the latest version MongoDB for Windows
Identifier: com.github.bigfix.bigfix.MongoDB-Win64
Input:
  NAME: MongoDB
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.MongoDB-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%latest_version%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./MongoDB/MongoDB-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
    Arguments:
      bes_file: "%content_file_pathname%"
      bes_customsite: autopkg
