---
Description: Downloads the latest Apple iCloud for Windows
Identifier: com.github.bigfix.download.iCloud-Win64
Input:
  NAME: "iCloud"
  DisplayName: "iCloud"
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://support.apple.com/en-us/HT204283
      re_pattern: '\<a href\=\"(?P<url>.*?)\"\>download iCloud for Windows'
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
