---
Description: Generates a BigFix Task for the latest Apple iTunes 64-bit
Identifier: com.github.bigfix.bigfix.iTunes
Input:
  NAME: "iTunes"
  DisplayName: "Apple iTunes"
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.iTunes
Process:
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "DisplayName"
      append_value: "%DisplayName%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Apple/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  #- Processor: com.github.jgstew.SharedProcessors/BESImport
  #- Processor: com.github.jgstew.SharedProcessors/BigFixActioner