---
Description: Generates a BigFix Task for the latest Apple iTunes 64-bit
Identifier: com.github.bigfix.bigfix.iTunes-Win64
Input:
  NAME: "iTunes"
  DisplayName: "iTunes"
  VendorFolder: Apple
  content_id_product: "002"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.iTunes-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/FileExeVersionExtractor
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_url: "%download_url%"
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon.png"
      url: https://support.apple.com/library/content/dam/edam/applecare/images/en_US/macos/macos-high-sierra-itunes-app-icon.png
      COMPUTE_HASHES: false
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/FileTextSearcher
    Arguments:
      first_result_only: True
      search_path: '%VendorFolder%\vendor_metadata.cfg'
      # output_variable: "file_search_results"
      file_search_results_var: "content_id_vendor"
      search_pattern: 'content_id_vendor *= *(\d+)'
      search_extension: ".cfg"
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Apple/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: true

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%content_id_vendor%%content_id_product%01 %NAME%-Update.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
