---
Description: Downloads the latest Apple iTunes 64-bit
Identifier: com.github.bigfix.download.iTunes-Win64
Input:
  NAME: "iTunes"
  DisplayName: "iTunes"
MinimumVersion: '2.3'
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.apple.com/itunes/download/win64
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/FileExeVersionExtractor
