---
Description: Downloads the latest Royal TS
Identifier: com.github.bigfix.download.RoyalTS
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "RoyalTS"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Royal TS"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.royalapps.com/ts/win/download
      # example match `example`
      re_pattern: 'RoyalTSInstaller_(?P<version>\d+\.\d+\.\d+\.\d+).msi'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.royalapps.com/RoyalTS/RoyalTSInstaller_%version%.msi
      download_version: ""
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
