---
Description: Downloads the latest NAPS2
Identifier: com.github.bigfix.download.naps2-win
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: NAPS2
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: NAPS2
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.naps2.com/download.html
      # example match `example`
      re_pattern: naps2-(?P<version>.*?)-setup.exe
  - Processor: URLDownloaderPython
    Arguments:
      url: https://github.com/cyanfish/naps2/releases/download/v%version%/naps2-%version%-setup.msi
      # download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
