---
Description: Downloads the latest AirParrot
Identifier: com.github.bigfix.download.AirParrot-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "AirParrot"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "AirParrot"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.airsquirrels.com/airparrot/download
      # example match `example`
      re_pattern: '.*>AirParrot 3 for Windows<.*\n.*>Version (?P<version>\d+\.\d+\.\d+)<'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.airsquirrels.com/AirParrot3/Windows/AirParrot-%version%-64.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
