---
Description: Downloads the latest Advanced Renamer
Identifier: com.github.bigfix.download.AdvancedRenamer
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "AdvancedRenamer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Advanced Renamer"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.advancedrenamer.com/download_older
      # example match `example`
      re_pattern: 'setup_(?P<version>\d+\_\d+\_\d+).exe'
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.advancedrenamer.com/download_older
      # example match `example`
      re_pattern: 'Download (?P<display_version>\d+\.\d+) installer'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.advancedrenamer.com/down/advanced_renamer_setup_%version%.exe
      download_version: ""
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
