---
Description: Downloads the latest VMware Tools
Identifier: com.github.bigfix.download.VMwareTools
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "VMwareTools"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "VMware Tools"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.

  - Processor: URLTextSearcher
    Arguments:
      url: https://packages.vmware.com/tools/releases/latest/windows/x64/
      # Example: VMware-tools-11.3.0-18090558-x86_64.exe
      re_pattern: '\<A.*?\=\"(?P<filename>VMware\-tools\-.*?\-x86\_64\.exe)\"\>'

  - Processor: URLDownloaderPython
    Arguments:
      url: https://packages.vmware.com/tools/releases/latest/windows/x64/%filename%
      prefetch_filename: True
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/FileExeVersionExtractor