---
Description: Downloads the latest VMware Remote Console for Win64
Identifier: com.github.bigfix.download.VMwareRemoteConsole-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: VMwareRemoteConsole
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: VMware Remote Console
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.

  - Processor: URLTextSearcher
    Arguments:
      url: https://softwareupdate.vmware.com/cds/vmw-desktop/vmrc-windows.xml
      # example match `<url>vmrc/12.0.1/18113358/windows/metadata.xml.gz</url>`
      re_pattern: '\<url\>vmrc\/(?P<version>.*?)\/.*?\/windows\/.*?\<\/url\>'

  - Processor: URLTextSearcher
    Arguments:
      url: https://softwareupdate.vmware.com/cds/vmw-desktop/vmrc-windows.xml
      # example match `<url>vmrc/12.0.1/18113358/windows/metadata.xml.gz</url>`
      re_pattern: '\<url\>vmrc\/.*?\/(?P<build>.*?)\/windows\/.*?\<\/url\>'

  - Processor: URLDownloaderPython
    Arguments:
      # example: https://softwareupdate.vmware.com/cds/vmw-desktop/vmrc/12.0.1/18113358/windows/vmrc-windows.tar
      url: https://softwareupdate.vmware.com/cds/vmw-desktop/vmrc/%version%/%build%/windows/vmrc-windows.tar
      download_version: "%version%"
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase
