---
Description: Download WinSCP Generates BigFix Task for latest WinSCP
Identifier: com.github.bigfix.bigfix.WinSCP-Win
Input:
  NAME: WinSCP
  DisplayName: WinSCP
  content_id_product: "001"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.WinSCP-Win
Process:
  # - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version%"
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/FileTextSearcher
    Arguments:
      first_result_only: True
      search_path: '%VendorFolder%\vendor_metadata.cfg'
      # output_variable: "file_search_results"
      file_search_results_var: "content_id_vendor"
      search_pattern: 'content_id_vendor *= *(\d+)'
      search_extension: ".cfg"
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon.png"
      url: https://upload.wikimedia.org/wikipedia/commons/d/de/WinSCP_Logo.png
      COMPUTE_HASHES: false
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./WinSCP/WinSCP-Win Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
    Arguments:
      bes_file: "%RECIPE_CACHE_DIR%/%NAME%.bes"
      bes_customsite: "AutoPKG"
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
