---
Description: Download WinSCP Generates BigFix Task for latest WinSCP
Identifier: com.github.bigfix.bigfix.WinSCP-Win
Input:
  NAME: WinSCP
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.WinSCP-Win
Process:
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%version%"
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon.png"
      url: https://upload.wikimedia.org/wikipedia/commons/d/de/WinSCP_Logo.png
      COMPUTE_HASHES: False
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "file_sha1"
      append_value: "%filehasher_sha1%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./WinSCP/WinSCP-Win Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
    Arguments:
      bes_file: "%RECIPE_CACHE_DIR%/%NAME%.bes"
      bes_customsite: "AutoPKG"
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner