---
Description: Downloads the latest WickrPro
Identifier: com.github.bigfix.download.WickrPro-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "WickrPro"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "WickrPro"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://pro-download.wickr.com/api/download/pro/download/windows
      # example match `example`
      re_pattern: 'WickrPro-(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://s3.amazonaws.com/static.wickr.com/downloads/win/pro/WickrPro-%version%.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
