---
Description: Downloads the latest WinPcap for Windows x64
Identifier: com.github.bigfix.download.winpcap-win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "WinPcap"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "WinPcap"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://nmap.org/download.html
      # example match `<b>Latest <u>stable</u> release self-installer: <a href="https://nmap.org/dist/nmap-7.92-setup.exe`
      re_pattern: '<b>Latest <u>stable<\/u> release self-installer: <a href="https:\/\/nmap\.org\/dist\/nmap-(?P<version>\d+\.\d+)-setup\.exe'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://nmap.org/dist/nmap-%version%-setup.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
