---
Description: Generates BigFix Task for latest OBS for Windows x64
Identifier: com.github.bigfix.bigfix.OBS-Win64
Input:
  NAME: OBSWin64
  # icon_url: https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/OBS_Studio_Logo.svg/240px-OBS_Studio_Logo.svg.png
MinimumVersion: '2.3'
ParentRecipe: com.github.bigfix.download.OBS-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    Arguments:
      template_version: "%latest_version%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./OBS/OBS-Win64-Install.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
