---
Description: Downloads the latest AirServer
Identifier: com.github.bigfix.download.AirServer-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "AirServer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "AirServer"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://support.airserver.com/support/solutions/articles/43000516018-airserver-universal-for-windows-7-8-1-10-release-notes
      # example match `example`
      re_pattern: '<strong>Version (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://dl.airserver.com/pc32/AirServer-5.6.3-x64.msi
#      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
