---
Description: Downloads the latest Everything
Identifier: com.github.bigfix.download.Everything-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Everything"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Everything"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.voidtools.com/downloads/
      # example match `example`
      re_pattern: 'Download Everything (?P<version>\d+\.\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.voidtools.com/Everything-%version%.x64.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
