---
Description: Downloads the latest Firefox x64 installer
Identifier: com.github.bigfix.download.Firefox-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "MozillaFirefox"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Mozilla Firefox (x64 en-US)"
  FilePrefix: Firefox%20Setup%20
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: com.github.jgstew.SharedProcessors/URLTextSearcherArray
    Arguments:
      url: https://www.mozilla.org/en-US/firefox/all/#product-desktop-release
      re_pattern: 'data-latest-firefox="(?P<version>([0-9]+(\.[0-9]+)+))"'
  - Processor: URLDownloaderPython
  # Note: The file downloaded is the installer so its version is not the version of Mozilla itself.
    Arguments:
      url: https://download.mozilla.org/?product=firefox-latest-ssl&os=win64&lang=en-US
      filename: firefox_setup.exe
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
