---
Description: Downloads the latest Firefox x64 installer
Identifier: com.github.bigfix.download.firefox
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "MozillaFirefox"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Mozilla Firefox (x64 en-US)"
  FilePrefix: Firefox%20Setup%20
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.mozilla.org/en-US/firefox/all/#product-desktop-release
      # example match `example`
      re_pattern: 'data-latest-firefox="(?P<version>(\d+\.\d\.\d))'
  - Processor: URLDownloaderPython
    Arguments:
      # https://download-installer.cdn.mozilla.net/pub/firefox/releases/91.0.1/win64/en-US/Firefox%20Setup%2091.0.1.msi
      # url: https://download-installer.cdn.mozilla.net/Firefox+Setup+%version%.msi
      url: "https://download-installer.cdn.mozilla.net/pub/firefox/releases/%version%/win64/en-US/%FilePrefix%%version%.msi"
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
