---
Description: Downloads the latest Firefox x64 installer
Identifier: com.github.bigfix.download.firefox
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Mozilla Firefox"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Mozilla Firefox (x64 en-US)"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.mozilla.org/en-US/firefox/all/#product-desktop-release
      # example match `example`
      re_pattern: 'data-latest-firefox="(?P<version>(\d+\.\d\.\d))'
  - Processor: URLDownloaderPython
    Arguments:
      url:  https://download-installer.cdn.mozilla.net/Firefox%20Setup%20%version%.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
