---
Description: Downloads the latest SeaMonkey For Windows x64
Identifier: com.github.bigfix.download.SeaMonkey-Win64
Input:
  NAME: "SeaMonkey"
  FileType: exe
  DisplayName: "SeaMonkey"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.seamonkey-project.org/releases/
      re_pattern: 'data-version="(?P<latest_version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://archive.mozilla.org/pub/seamonkey/releases/%latest_version%/win64/en-US/seamonkey-%latest_version%.en-US.win64.installer.%FileType%'
      download_version: "%latest_version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
