---
Description: Downloads the latest Mozilla Foundation - Thunderbird
Identifier: com.github.bigfix.download.Thunderbird-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: Thunderbird
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Thunderbird
  FilePrefix: Thunderbird%20Setup%20
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
 # NOTE: every download recipe is going to be a bit different depending on the software
  #        that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.thunderbird.net/en-US/
      # example match `example`
      re_pattern: 'softwareVersion\" content=\"(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/%version%/win64/en-US/%FilePrefix%%version%.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
