---
Description: Generates a BigFix Task for the latest Thunderbird ESR
Identifier: com.github.bigfix.bigfix.ThunderbirdESR-Win64
Input:
  NAME: "ThunderbirdESR"
  icon_url: https://www.dailyhostnews.com/wp-content/uploads/2019/03/Azure-featured-1050x600.png
  DisplayName: "Thunderbird ESR"
  DocLink: https://docs.microsoft.com/en-us/sql/azure-data-studio/download-azure-data-studio?view=sql-server-ver15
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.ThunderbirdESR-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  # download icon file:
  # - Processor: URLDownloaderPython
  #   Arguments:
  #     # need to provide filename to not overwrite the setup file
  #     filename: "%NAME%-icon.png"
  #     url: "%icon_url%"
  #     COMPUTE_HASHES: False
  # - Processor: com.github.jgstew.SharedProcessors/FileImageResize
  # # get base64 of icon file
  # - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  #   Arguments:
  #     file_pathname: "%file_path_resized%"
  # # add base64 of icon file to Template Dictionary
  # - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
  #   Arguments:
  #     append_key: "icon_base64"
  #     append_value: "%file_base64%"
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./ThunderbirdESR/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  # `BESImport` imports the generated BES content into a BigFix Server
  #   Which server and credentials are used is dictated by `~/.besapi.conf`
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  # `BigFixActioner` creates an action from the imported BigFix Content
  #   The action is an offer that requires user interaction to run in self service application
  #   The action targets all computers whose name contains `autopkg`
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
