---
Description: Generates a BigFix Task for the latest Go Programming Language (Win64)
Identifier: com.github.bigfix.bigfix.Go-Win64
Input:
  NAME: "Go"
  DisplayName: "Go Programming Language"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.Go-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon-320_120.png"
      url: https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Go_Logo_Blue.svg/320px-Go_Logo_Blue.svg.png
      COMPUTE_HASHES: False
      download_version: ""

  # get base64 of icon file:
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "DisplayName"
      append_value: "%DisplayName%"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Go/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport

  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
