---
Description: Downloads the latest GoodSync
Identifier: com.github.bigfix.download.GoodSync-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: GoodSync
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: GoodSync
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.goodsync.com/download
      # example match `example`
      re_pattern: 'Version (?P<version>\d+) has been released'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.goodsync.com/download/GoodSync-v%version%-Setup.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
