---
Description: Downloads the latest Node.js
Identifier: com.github.bigfix.download.NodeJS
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: NodeJS
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: Node.js
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://nodejs.org/en/download/
      # example match `example`
      re_pattern: 'Latest\s+LTS\s+Version:.+?(?P<version>\d+\.\d+\.\d+)\W'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://nodejs.org/dist/v%version%/node-v%version%-x64.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
