---
Description: Downloads the latest CutePDFWriter-Win64
Identifier: com.github.bigfix.download.CutePDFWriter-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "CutePDFWriter"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "CutePDF Writer"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.cutepdf.com/download/CuteWriter.exe
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
