---
Description: Downloads the latest Filezilla For Windows x64
Identifier: com.github.zanesand.download.Filezilla-Win64
Input:
  NAME: "Filezilla"
  FileType: exe
  DisplayName: "Filezilla"
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://filezilla-project.org/download.php?show_all=1
      re_pattern: 'The latest stable version of FileZilla Client is (?P<latest_version>([0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}))'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.filezilla-project.org/client/FileZilla_%latest_version%_win64-setup.%FileType%
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
