---
Description: Downloads the latest Adobe Digital Editions
Identifier: com.github.bigfix.download.AdobeDigitalEditions-Win
Input:
  NAME: "AdobeDigitalEditions"
  DisplayName: "Adobe Digital Editions"
  FileType: exe
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.adobe.com/au/solutions/ebook/digital-editions/download.html
      re_pattern: '<h2><b>Adobe Digital Editions (?P<version>\d+\.\d+\.\d+)'
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.adobe.com/au/solutions/ebook/digital-editions/download.html
      re_pattern: '<a href="https://adedownload.adobe.com/pub/adobe/digitaleditions/ADE_(?P<major_version>\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://adedownload.adobe.com/pub/adobe/digitaleditions/ADE_%major_version%_Installer.%FileType%
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
