---
Description: Downloads the latest Terraform
Identifier: com.github.bigfix.download.Terraform
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Terraform"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Terraform"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.terraform.io/downloads.html
      # example match `example`
      re_pattern: 'terraform_(?P<version>\d+\.\d+\.\d+)_windows_amd64.zip'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://releases.hashicorp.com/terraform/%version%/terraform_%version%_windows_amd64.zip
      download_version: ""
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
