---
Description: Downloads the latest Archi
Identifier: com.github.bigfix.download.Archi-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Archi"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Archi"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.archimatetool.com/download/
      # example match `example`
      re_pattern: 'version="(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://www.archimatetool.com/downloads/archi/
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
