---
Description: Generates a BigFix Task for the latest Podman for Windows x64
Identifier: com.github.bigfix.bigfix.Podman-Win64
Input:
  NAME: Podman
  DisplayName: "%NAME%"
  VendorFolder: "%NAME%"
  template_file_path: ".templates/Shared-Win-Install_Update.bes.mustache"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.Podman-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/GetCommonPlatformEnumeration
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  # download icon file:
  - Processor: URLDownloaderPython
    Arguments:
      filename: "podman-logo.png"
      url: "https://raw.githubusercontent.com/containers/podman/main/logo/podman-logo.png"
      COMPUTE_HASHES: False
      download_version: ""

  - Processor: com.github.jgstew.SharedProcessors/FileImageResize

  # get base64 of icon file:
  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64
    Arguments:
      file_pathname: "%file_path_resized%"

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      #template_file_path: "./Podman/Podman-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "install_only"
      append_value: True

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-InstallOnly.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
