---
Description: Downloads the latest CPU-Z For Windows X64
Identifier: com.github.bigfix.download.CPUZ-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "CPUZ"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "CPUID CPU-Z"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.cpuid.com/softwares/cpu-z.html
      # example match `example`
      re_pattern: 'cpu\-z_(?P<version>\d+\.\d+)\-en\.exe'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.cpuid.com/cpu-z/cpu-z_%version%-en.exe
      # download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
