---
Description: Downloads the latest Microsoft Teams
Identifier: com.github.bigfix.download.MicrosoftTeams-Win64
Input:
  NAME: "MicrosoftTeams"
  DisplayName: "Microsoft Teams"
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://teams.microsoft.com/downloads/desktopurl?env=production&plat=windows&arch=x64&download=false&managedInstaller=true
      # example match `1.4.00.19572 - need to ignore the double 00 and replace with a single 0`
      re_pattern: '\/(?P<verpart1>\d+\.\d+\.)\d{2}(?P<verpart2>\.\d+)\/'
  - Processor: URLTextSearcher
    Arguments:
      url: https://teams.microsoft.com/downloads/desktopurl?env=production&plat=windows&arch=x64&download=false&managedInstaller=true
      # example match `https://statics.teams.cdn.office.net/production-windows-x64/1.4.00.19572/Teams_windows_x64.msi`
      re_pattern: '(?P<url>https\:\/\/statics\.teams\.cdn\.office\.net\/production\-windows\-x64\/\d+\.\d+\.\d+\.\d+\/Teams_windows_x64.msi)'
  - Processor: URLDownloaderPython
    Arguments:
      url: "%url%"
      # Need to calculate the version number that will eventually be used for relevance purposes by removing an extraneous zero that Microsoft inserts
      download_version: "%verpart1%0%verpart2%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
