---
Description: Downloads the latest Microsoft PowerToys
Identifier: com.github.bigfix.download.PowerToys-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "PowerToys-Win64"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Microsoft PowerToys (Win64)"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://github.com/microsoft/PowerToys/releases/
      # example match `example`
      re_pattern: 'Release v(?P<version>\d+\.\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://github.com/microsoft/PowerToys/releases/download/v%version%/PowerToysSetup-%version%-x64.exe
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
