---
Description: Downloads the latest Microsoft Safety Scanner
Identifier: com.github.bigfix.download.SafetyScanner
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "SafetyScanner"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Microsoft Safety Scanner"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: https://go.microsoft.com/fwlink/?LinkId=212732
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
