---
Description: Downloads the latest SQL Server Management Studio
Identifier: com.github.bigfix.download.SQLServerManagementStudio-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "SQLServerManagementStudio"
  FileType: exe
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "SQL Server Management Studio"
  DocLink: https://docs.microsoft.com/en-us/sql/ssms/download-sql-server-management-studio-ssms
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.shared.parent-recipe
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://docs.microsoft.com/en-us/sql/ssms/release-notes-ssms
      re_pattern: 'SSMS (?P<bundle_version>\d+\.\d+(\.\d+)?) is the latest general availability \(GA\) release of SSMS'
  - Processor: URLDownloaderPython
    Arguments:
      prefetch_filename: True
      url: https://aka.ms/ssmsfullsetup
      download_version: "%bundle_version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
