---
Description: Downloads the latest Sysinternals Utilities for Win64
Identifier: com.github.bigfix.download.Sysinternals-Win64
Input:
  NAME: Sysinternals
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.shared.parent-recipe
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://docs.microsoft.com/en-us/sysinternals/downloads/sysinternals-suite
      # example match `Updated: July 27, 2021`
      re_pattern: 'Updated: (?P<release_date>\w+ \d{1,2}, \d{4})'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://download.sysinternals.com/files/SysinternalsSuite.zip
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
