---
Description: Downloads the latest Microsoft Visual C++ 2015-2019 Redistributable (x64) for Win64
Identifier: com.github.bigfix.download.VisualC++Redistx64-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "VisualC++Redistx64"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Microsoft Visual C++ 2015-2019 Redistributable (x64)"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: https://aka.ms/vs/16/release/vc_redist.x64.exe
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
