---
Description: Generates a BigFix Task for the latest Visual Studio Community 2019
Identifier: com.github.bigfix.bigfix.VSCommunity2019
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "VSCommunity2019"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Visual Studio Community 2019"
MinimumVersion: "2.3"
ParentRecipe: com.github.bigfix.download.VSCommunity2019
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # `BigFixPrefetchItem` takes the hashes from `URLDownloaderPython`
  #   Then it assembles them into a BigFix Prefetch Statement or Block
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_url: "%download_url%"
  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  # `TemplateDictionaryAppendInput` adds extra variables to the Template Dictionary
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput
  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./Microsoft/%NAME%-Win64-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  # `BESImport` imports the generated BES content into a BigFix Server
  #   Which server and credentials are used is dictated by `~/.besapi.conf`
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  # `BigFixActioner` creates an action from the imported BigFix Content
  #   The action is an offer that requires user interaction to run in self service application
  #   The action targets all computers whose name contains `autopkg`
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: True
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
