---
Description: Downloads the latest Microsoft Visual Code (x64)
Identifier: com.github.bigfix.download.VSCode-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "VSCode"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Microsoft Visual Studio Code"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: https://code.visualstudio.com/sha/download?build=stable&os=win32-x64
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/FileExeVersionExtractor
