---
Description: Downloads the latest Windows 11 PC Health Check App
Identifier: com.github.bigfix.download.Win11PCHealthCheckApp
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Win11PCHealthCheckApp"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Windows PC Health Check"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLDownloaderPython
    Arguments:
      url: https://aka.ms/GetPCHealthCheckApp
      prefetch_filename: True
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
