---
Description: Downloads the latest GOMPlayer
Identifier: com.github.bigfix.download.GOMPlayer-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "GOMPlayer"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "GOM Player"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods

  # NOTE: DISABLED: DUE TO ADWARE!
  # - Processor: URLDownloaderPython
  #   Arguments:
  #     url: # CONTAINS ADWARE! # https://cdn.gomlab.com/gretech/player/GOMPLAYERGLOBALSETUP_NEW.EXE
  #     COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
