---
Description: Downloads the latest Paint.net for Windows x64
Identifier: com.github.bigfix.download.Paint.net-Win64
Input:
  NAME: Paint.net
  FileType: zip
  DisplayName: Paint.net
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # - Processor: URLTextSearcher
  #   Arguments:
  #     url: https://github.com/paintdotnet/release #href="/paintdotnet/release/releases/tag/v4.3.3">
  #     re_pattern: '/paintdotnet/release/releases/tag/v(?P<version>\d+\.\d+\.\d+)'
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: paintdotnet/release #paint.net.4.3.3.winmsi.x64.zip
      asset_regex: paint\.net\..*\.winmsi\.x64\.%FileType%
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
