---
Description: Downloads the latest Apache Directory Studio (Win64)
Identifier: com.github.bigfix.download.ApacheDirectoryStudio-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "ApacheDirectoryStudio-Win64"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Apache Directory Studio (Win64)"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: http://directory.apache.org/studio/download/download-windows.html
      re_pattern: 'ApacheDirectoryStudio-(?P<version>\d+\.\d+\.\d+.v\d+-M\d+)-win32.win32.x86_64.exe'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://archive.apache.org/dist/directory/studio/%version%/ApacheDirectoryStudio-%version%-win32.win32.x86_64.exe
      # download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
