---
Description: Downloads the latest Inkscape
Identifier: com.github.bigfix.download.Inkscape-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Inkscape"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Inkscape"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://inkscape.org/
      # example match `example`
      re_pattern: 'Welcome to Inkscape (?P<version>\d+\.\d+)'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://media.inkscape.org/dl/resources/file/inkscape-%version%-x64.msi
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
