---
Description: Downloads the latest Notepad++ For Windows x64
Identifier: com.github.bigfix.download.NotepadPlusPlus-Win64
Input:
  NAME: "NotepadPlusPlus"
  FileType: exe
  DisplayName: "Notepad++"
MinimumVersion: '2.3'
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods

  - Processor: URLTextSearcher
    Arguments:
      url: https://notepad-plus-plus.org/update/getDownloadUrl.php
      re_pattern: '<Version>(?P<latest_version>\d+\.\d+\.\d+)</Version>'
  - Processor: URLTextSearcher
    Arguments:
      url: https://notepad-plus-plus.org/update/getDownloadUrl.php
      re_pattern: '<Location>(?P<url>http.*)</Location>'
  - Processor: URLDownloaderPython
    Arguments:
      url: '%url%'
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
