---
Description: Downloads the latest Jitsi
Identifier: com.github.bigfix.download.Jitsi-Win64
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "Jitsi"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Jitsi"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # NOTE: every download recipe is going to be a bit different depending on the software
  #         that said, there a few common cases to use as examples.
  - Processor: URLTextSearcher
    Arguments:
      url: https://desktop.jitsi.org/Main/Download.html
      # example match `example`
      re_pattern: 'jitsi-(?P<version>\d+\.\d+\.\d+)-x64.msi'
  - Processor: URLDownloaderPython
    Arguments:
      url: https://github.com/jitsi/jitsi/releases/download/Jitsi-2.10/jitsi-%version%-x64.msi
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
